Revit 2024 API
ReferenceIntersector Constructor
Overload List
Name | Description
ReferenceIntersector(View3D)
 Constructs a ReferenceIntersector which is set to return intersections from all elements and representing all reference target types.
ReferenceIntersector(ElementFilter, FindReferenceTarget, View3D)
 Constructs a ReferenceIntersector which is set to return intersections from any element which passes an input filter.
ReferenceIntersector(ElementId, FindReferenceTarget, View3D)
 Constructs a ReferenceIntersector which is set to return intersections from a single target element only.
ReferenceIntersector(ICollection<ElementId>, FindReferenceTarget, View3D)
 Constructs a ReferenceIntersector which is set to return intersections from any of a set of target elements.
See Also
ReferenceIntersector Class
ReferenceIntersector Members
Autodesk.Revit.DB Namespace